app/Controllers/AlatController.php

    public function halAlat()
    {
        $data = [
            'judul' => 'Kalibrasi - Daftar Alat',
            'getdata' => $this->alat->findAll(),
---
SELECT *
FROM `alat`