app/Controllers/Home.php

    public function halLokasi()
    {
        $data = [
            'judul' => 'Kalibrasi - Lokasi Alat',
            'getdata' => $this->lokasi->findAll(), // Mengambil semua data lokasi
---
SELECT *
FROM `lokasi`