app/Controllers/PemakaiController.php

SELECT *
FROM `pemakai`
---
    public function index()
    {
        $data = [
            'judul' => 'Daftar Pemakai',
            'getdata' => $this->pemakai->findAll(),