app/Controllers/PetugasController.php

    public function index()
    {
        $data = [
            'judul' => 'Daftar Petugas',
            'petugas' => $this->petugasModel->findAll(),
---
SELECT *
FROM `petugas`