app/Controllers/VendorController.php

    public function index()
    {
        $data = [
            'judul' => 'Daftar Vendor',
            'getdata' => $this->vendor->findAll(),
---
SELECT *
FROM `vendor`

    public function halEdit($IdVendor)
    {
        $vendor = $this->vendor->find($IdVendor);
---
SELECT *
FROM `vendor`
WHERE `vendor`.`IdVendor` = 'bnb'

            return redirect()->back()->withInput()->with('validation', $validation->getErrors());
        }

        $this->vendor->update($IdVendor, [
            'NamaVendor'    => esc($this->request->getPost('NamaVendor')),
            'Alamat'        => esc($this->request->getPost('Alamat')),
            'Kota'          => esc($this->request->getPost('Kota')),
            'Telpon'        => esc($this->request->getPost('Telpon')),
            'Fax'           => esc($this->request->getPost('Fax')),
            'Email'         => esc($this->request->getPost('Email')),
            'ContactPerson' => esc($this->request->getPost('ContactPerson')),
        ]);
---
UPDATE `vendor` SET `NamaVendor` = 'oppo', `Alamat` = 'opp', `Kota` = 'ppp', `Telpon` = '909090', `Fax` = '09', `Email` = 'kok@gmail.com', `ContactPerson` = 'kkok'
WHERE `vendor`.`IdVendor` IN ('opp')

    public function hapusVendor($IdVendor)
    {
        if (!$this->vendor->find($IdVendor)) {
            return redirect()->to('/vendor/halVendor')->with('gagal', "Vendor dengan ID $IdVendor tidak ditemukan.");
        }

        $this->vendor->delete($IdVendor);
---
SELECT *
FROM `vendor`
WHERE `vendor`.`IdVendor` = 'tgtgt'
DELETE FROM `vendor`
WHERE `IdVendor` IN ('tgtgt')